Applying **dev**:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.local_file.kubeconfig[0] has been deleted
-   resource "local_file" "kubeconfig" {
-       content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
-             cluster:
                server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_andrei-eks
            
            contexts:
-             context:
                cluster: eks_andrei-eks
                user: eks_andrei-eks
              name: eks_andrei-eks
            
            current-context: eks_andrei-eks
            
            users:
-             name: eks_andrei-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
-                     "token"
-                     "-i"
-                     "andrei-eks"
        EOT -> null
-       directory_permission = "0755" -> null
-       file_permission      = "0600" -> null
-       filename             = "./kubeconfig_andrei-eks" -> null
-       id                   = "761770546894ce136652d2351aa4140ea750e426" -> null
    }
  # module.eks.aws_autoscaling_group.workers[0] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
+       arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:83930de6-db69-4165-86c1-74c502ce671b:autoScalingGroupName/andrei-eks-worker-group-120220318143523238000000001"
      ~ availability_zones        = [
+           "eu-north-1a",
+           "eu-north-1b",
+           "eu-north-1c",
        ]
+       default_cooldown          = 300
+       enabled_metrics           = []
+       health_check_type         = "EC2"
        id                        = "andrei-eks-worker-group-120220318143523238000000001"
+       load_balancers            = []
+       name                      = "andrei-eks-worker-group-120220318143523238000000001"
+       service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      ~ suspended_processes       = [
-           "AZRebalance",
        ]
+       target_group_arns         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group.workers[0] is tainted, so must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:83930de6-db69-4165-86c1-74c502ce671b:autoScalingGroupName/andrei-eks-worker-group-120220318143523238000000001" -> (known after apply)
      ~ availability_zones        = [
-           "eu-north-1a",
-           "eu-north-1b",
-           "eu-north-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
-       enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "andrei-eks-worker-group-120220318143523238000000001" -> (known after apply)
      ~ launch_configuration      = "andrei-eks-worker-group-120220318142159836100000001" -> (known after apply)
-       load_balancers            = [] -> null
      ~ name                      = "andrei-eks-worker-group-120220318143523238000000001" -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      ~ suspended_processes       = [
+           "AZRebalance",
        ]
-       target_group_arns         = [] -> null
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] (deposed object 4c4bbcea) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_autoscaling_group" "workers" {
-       arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:3f6ac6f3-1b45-4c2b-8009-7a1156e96a85:autoScalingGroupName/andrei-eks-worker-group-120220318131150126500000016" -> null
-       availability_zones        = [
-           "eu-north-1a",
-           "eu-north-1b",
-           "eu-north-1c",
        ] -> null
-       capacity_rebalance        = false -> null
-       default_cooldown          = 300 -> null
-       desired_capacity          = 2 -> null
-       enabled_metrics           = [] -> null
-       force_delete              = false -> null
-       force_delete_warm_pool    = false -> null
-       health_check_grace_period = 300 -> null
-       health_check_type         = "EC2" -> null
-       id                        = "andrei-eks-worker-group-120220318131150126500000016" -> null
-       launch_configuration      = "andrei-eks-worker-group-120220318131138820500000015" -> null
-       load_balancers            = [] -> null
-       max_instance_lifetime     = 0 -> null
-       max_size                  = 3 -> null
-       metrics_granularity       = "1Minute" -> null
-       min_size                  = 1 -> null
-       name                      = "andrei-eks-worker-group-120220318131150126500000016" -> null
-       name_prefix               = "andrei-eks-worker-group-1" -> null
-       protect_from_scale_in     = false -> null
-       service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
-       suspended_processes       = [] -> null
-       target_group_arns         = [] -> null
-       termination_policies      = [] -> null
-       vpc_zone_identifier       = [
-           "subnet-02336bd68343bb267",
-           "subnet-05412ced6b2018325",
-           "subnet-0ac0c439e4fbdb4dc",
        ] -> null
-       wait_for_capacity_timeout = "10m" -> null

-       tag {
-           key                 = "Name" -> null
-           propagate_at_launch = true -> null
-           value               = "andrei-eks-worker-group-1-eks_asg" -> null
        }
-       tag {
-           key                 = "k8s.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
-       tag {
-           key                 = "kubernetes.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] (deposed object 8a2cb99f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_autoscaling_group" "workers" {
-       arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:f91cd1a6-e265-4a73-8842-659c07839411:autoScalingGroupName/andrei-eks-worker-group-120220318142201185200000002" -> null
-       availability_zones        = [
-           "eu-north-1a",
-           "eu-north-1b",
-           "eu-north-1c",
        ] -> null
-       capacity_rebalance        = false -> null
-       default_cooldown          = 300 -> null
-       desired_capacity          = 1 -> null
-       enabled_metrics           = [] -> null
-       force_delete              = false -> null
-       force_delete_warm_pool    = false -> null
-       health_check_grace_period = 300 -> null
-       health_check_type         = "EC2" -> null
-       id                        = "andrei-eks-worker-group-120220318142201185200000002" -> null
-       launch_configuration      = "andrei-eks-worker-group-120220318142159836100000001" -> null
-       load_balancers            = [] -> null
-       max_instance_lifetime     = 0 -> null
-       max_size                  = 2 -> null
-       metrics_granularity       = "1Minute" -> null
-       min_size                  = 1 -> null
-       name                      = "andrei-eks-worker-group-120220318142201185200000002" -> null
-       name_prefix               = "andrei-eks-worker-group-1" -> null
-       protect_from_scale_in     = false -> null
-       service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
-       suspended_processes       = [] -> null
-       target_group_arns         = [] -> null
-       termination_policies      = [] -> null
-       vpc_zone_identifier       = [
-           "subnet-02336bd68343bb267",
-           "subnet-05412ced6b2018325",
-           "subnet-0ac0c439e4fbdb4dc",
        ] -> null
-       wait_for_capacity_timeout = "10m" -> null

-       tag {
-           key                 = "Name" -> null
-           propagate_at_launch = true -> null
-           value               = "andrei-eks-worker-group-1-eks_asg" -> null
        }
-       tag {
-           key                 = "k8s.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
-       tag {
-           key                 = "kubernetes.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] (deposed object c547a308) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_autoscaling_group" "workers" {
-       arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:1e160ac7-1572-48f5-afdb-021265087651:autoScalingGroupName/andrei-eks-worker-group-120220318134039185000000001" -> null
-       availability_zones        = [
-           "eu-north-1a",
-           "eu-north-1b",
-           "eu-north-1c",
        ] -> null
-       capacity_rebalance        = false -> null
-       default_cooldown          = 300 -> null
-       desired_capacity          = 2 -> null
-       enabled_metrics           = [] -> null
-       force_delete              = false -> null
-       force_delete_warm_pool    = false -> null
-       health_check_grace_period = 300 -> null
-       health_check_type         = "EC2" -> null
-       id                        = "andrei-eks-worker-group-120220318134039185000000001" -> null
-       launch_configuration      = "andrei-eks-worker-group-120220318131138820500000015" -> null
-       load_balancers            = [] -> null
-       max_instance_lifetime     = 0 -> null
-       max_size                  = 3 -> null
-       metrics_granularity       = "1Minute" -> null
-       min_size                  = 1 -> null
-       name                      = "andrei-eks-worker-group-120220318134039185000000001" -> null
-       name_prefix               = "andrei-eks-worker-group-1" -> null
-       protect_from_scale_in     = false -> null
-       service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
-       suspended_processes       = [] -> null
-       target_group_arns         = [] -> null
-       termination_policies      = [] -> null
-       vpc_zone_identifier       = [
-           "subnet-02336bd68343bb267",
-           "subnet-05412ced6b2018325",
-           "subnet-0ac0c439e4fbdb4dc",
        ] -> null
-       wait_for_capacity_timeout = "10m" -> null

-       tag {
-           key                 = "Name" -> null
-           propagate_at_launch = true -> null
-           value               = "andrei-eks-worker-group-1-eks_asg" -> null
        }
-       tag {
-           key                 = "k8s.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
-       tag {
-           key                 = "kubernetes.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] (deposed object e1e73a85) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_autoscaling_group" "workers" {
-       arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:805a9c6f-c2ad-43e3-a9ab-645692a2926e:autoScalingGroupName/andrei-eks-worker-group-120220318135647832900000002" -> null
-       availability_zones        = [
-           "eu-north-1a",
-           "eu-north-1b",
-           "eu-north-1c",
        ] -> null
-       capacity_rebalance        = false -> null
-       default_cooldown          = 300 -> null
-       desired_capacity          = 2 -> null
-       enabled_metrics           = [] -> null
-       force_delete              = false -> null
-       force_delete_warm_pool    = false -> null
-       health_check_grace_period = 300 -> null
-       health_check_type         = "EC2" -> null
-       id                        = "andrei-eks-worker-group-120220318135647832900000002" -> null
-       launch_configuration      = "andrei-eks-worker-group-120220318135645896200000001" -> null
-       load_balancers            = [] -> null
-       max_instance_lifetime     = 0 -> null
-       max_size                  = 3 -> null
-       metrics_granularity       = "1Minute" -> null
-       min_size                  = 1 -> null
-       name                      = "andrei-eks-worker-group-120220318135647832900000002" -> null
-       name_prefix               = "andrei-eks-worker-group-1" -> null
-       protect_from_scale_in     = false -> null
-       service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
-       suspended_processes       = [] -> null
-       target_group_arns         = [] -> null
-       termination_policies      = [] -> null
-       vpc_zone_identifier       = [
-           "subnet-02336bd68343bb267",
-           "subnet-05412ced6b2018325",
-           "subnet-0ac0c439e4fbdb4dc",
        ] -> null
-       wait_for_capacity_timeout = "10m" -> null

-       tag {
-           key                 = "Name" -> null
-           propagate_at_launch = true -> null
-           value               = "andrei-eks-worker-group-1-eks_asg" -> null
        }
-       tag {
-           key                 = "k8s.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
-       tag {
-           key                 = "kubernetes.io/cluster/andrei-eks" -> null
-           propagate_at_launch = true -> null
-           value               = "owned" -> null
        }
    }

  # module.eks.aws_iam_instance_profile.workers[1] will be destroyed
-   resource "aws_iam_instance_profile" "workers" {
-       arn         = "arn:aws:iam::994647055425:instance-profile/andrei-eks20220318131138608100000010" -> null
-       create_date = "2022-03-18T13:11:38Z" -> null
-       id          = "andrei-eks20220318131138608100000010" -> null
-       name        = "andrei-eks20220318131138608100000010" -> null
-       name_prefix = "andrei-eks" -> null
-       path        = "/" -> null
-       role        = "andrei-eks2022031813113780340000000e" -> null
-       tags        = {} -> null
-       tags_all    = {} -> null
-       unique_id   = "AIPA6PFMVTRAZMVFDNKW6" -> null
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:7d56d528-0951-42e2-ae10-830022111e57:launchConfigurationName/andrei-eks-worker-group-120220318142159836100000001" -> (known after apply)
      ~ id                               = "andrei-eks-worker-group-120220318142159836100000001" -> (known after apply)
      ~ instance_type                    = "m4.large" -> "t3.small" # forces replacement
+       key_name                         = (known after apply)
      ~ name                             = "andrei-eks-worker-group-120220318142159836100000001" -> (known after apply)
-       vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           no_device             = (known after apply)
+           snapshot_id           = (known after apply)
+           throughput            = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[0] (deposed object 23339bec) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_launch_configuration" "workers" {
-       arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:c5e65a64-8cc5-4a93-bbc3-6322df704167:launchConfigurationName/andrei-eks-worker-group-120220318135645896200000001" -> null
-       associate_public_ip_address      = false -> null
-       ebs_optimized                    = false -> null
-       enable_monitoring                = true -> null
-       iam_instance_profile             = "andrei-eks2022031813113860660000000f" -> null
-       id                               = "andrei-eks-worker-group-120220318135645896200000001" -> null
-       image_id                         = "ami-0e7747683c4988ae6" -> null
-       instance_type                    = "t2.large" -> null
-       name                             = "andrei-eks-worker-group-120220318135645896200000001" -> null
-       name_prefix                      = "andrei-eks-worker-group-1" -> null
-       security_groups                  = [
-           "sg-06a754dc7e546975f",
-           "sg-0d54464eea313cb61",
        ] -> null
-       user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplVTFFVFhoUFJFVjZUVVJuTUU1R2IxaEVWRTE1VFVSTmVFNVVSWHBOUkdjd1RrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGxoSENtbzNNMjVtVkVaSFdVWmtaMWg1U21NM2EwSjNUVGhFTkZSR1lWY3dhWEYwWVc1Rk1XZFZNa05hVVZOd05EbExZalZXVWpCNFdVZHZSVTgxVDBWYVRtVUtSV0o0VTNoT01EUnhaWEl5VEhCeFUycDZTMWhMYm1OMFoyRnZOQzlxTmxVclUybE9ObFJXU25aVWNXZDNjR3MwUmxkRFZscFFhbEpRVnpKVmNXSTRhZ3BpZUhOTk5ESllNRkkzWlU5d0wxUmpTbTVPWWtWbmVtcEZiMkpSWXpZNU1FZ3ZOazFsWm1Vdk5FOUlNMnhyYkhOaWJtNVBiRzFoTWxrdlpUWmtSSGxRQ21FeEwwUjBXaXQ0VFROd00xa3hkbTFDVW5KcU1GRmxMMGhsWmtJd2NtOW1NbUpGZW1aNU5IaFhiME5DT0hOa1ZqUkNlRE5FT0ZWamJWRm9UalpFTDFrS2NqTmliVGxGVDI1Qk1HWmlhRkpVVTNVemExbElXRVl2WW0weWVtUkhLM0UyZDA5TVVHczJjRkZVYWxadFoxQTNibEY2WW05c1duZENaRGxMYjFKeWNRbzJXRUZyTldaQlVsVmhRVzFSYVVvMVkwdFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxka3hIVkVOck5YQmpSRkpIVjFBNFFVSktRVUVyZVVaSk1XRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNURlUzTVROdGVuUXdTM0kwU1hWaVUxcDFObTlJWmtaV1FrTnRUR2R6YUVSVVdWRnNSa2Q0U2tob2RVd3JSa2hQZGdwUU5UQjFPR2xWWWxkT2JqRk9jVlIxTDFGbmVHeGFkMjVMTmpCeVozTXlVR2RQUlhVMFQybFRNbVJzWWxKNVpVZEtNVzgwYTFaWFdGcG5iSG8yY2t4aENtRjBaU3REWnpCMlUwbFVhVTlGTlVaU1ZqZFBkbkpCWmsxc2NXbDNSbTlCYWtRMWEyaHBOSFZ4YVZGeWJXdEJSMDFHV0dGa1dtOU1PV2RqTkU5QmJYTUtZbnA0TlZScllYWXdUemRNZUN0NGQwUnZZMXB4TW1OaldXOXVSMWhyTmxjdk1VOURjSE5wVFhCV01YTkpXSGd2T0VWTFVHNUpZakJMUmsxak1VUlViQXBaVkhoRFlrZFNia3hPWkN0MVkxUjRRMFIwZDIxVVNXZE5kVWw2V20xdlZ6QkpiamRzVVZoSmJYZEZVMHhNZW1SVmIycGpRVkptU214d2IwbG5MMFpJQ2prMk1WQmhORFptTjFSTGJ5dGlibmxrZUVKTllXUjVRMWh4TVVOcFRYTmhiRGRWUXdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzE3RjIxNEQ3QTY2ODQyMzg3QjFDMDg3MDU0NTNEN0Muc2sxLmV1LW5vcnRoLTEuZWtzLmFtYXpvbmF3cy5jb20nICAtLWt1YmVsZXQtZXh0cmEtYXJncyAiIiAnYW5kcmVpLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> null
-       vpc_classic_link_security_groups = [] -> null

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           encrypted             = false -> null
-           iops                  = 0 -> null
-           throughput            = 0 -> null
-           volume_size           = 100 -> null
-           volume_type           = "gp2" -> null
        }
    }

  # module.eks.aws_launch_configuration.workers[0] (deposed object 5d15ca78) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_launch_configuration" "workers" {
-       arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:e76cf438-0eec-405b-a9e4-35b2e49f51fe:launchConfigurationName/andrei-eks-worker-group-120220318131138820500000015" -> null
-       associate_public_ip_address      = false -> null
-       ebs_optimized                    = false -> null
-       enable_monitoring                = true -> null
-       iam_instance_profile             = "andrei-eks2022031813113860660000000f" -> null
-       id                               = "andrei-eks-worker-group-120220318131138820500000015" -> null
-       image_id                         = "ami-0e7747683c4988ae6" -> null
-       instance_type                    = "t2.small" -> null
-       name                             = "andrei-eks-worker-group-120220318131138820500000015" -> null
-       name_prefix                      = "andrei-eks-worker-group-1" -> null
-       security_groups                  = [
-           "sg-06a754dc7e546975f",
-           "sg-0d54464eea313cb61",
        ] -> null
-       user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplVTFFVFhoUFJFVjZUVVJuTUU1R2IxaEVWRTE1VFVSTmVFNVVSWHBOUkdjd1RrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGxoSENtbzNNMjVtVkVaSFdVWmtaMWg1U21NM2EwSjNUVGhFTkZSR1lWY3dhWEYwWVc1Rk1XZFZNa05hVVZOd05EbExZalZXVWpCNFdVZHZSVTgxVDBWYVRtVUtSV0o0VTNoT01EUnhaWEl5VEhCeFUycDZTMWhMYm1OMFoyRnZOQzlxTmxVclUybE9ObFJXU25aVWNXZDNjR3MwUmxkRFZscFFhbEpRVnpKVmNXSTRhZ3BpZUhOTk5ESllNRkkzWlU5d0wxUmpTbTVPWWtWbmVtcEZiMkpSWXpZNU1FZ3ZOazFsWm1Vdk5FOUlNMnhyYkhOaWJtNVBiRzFoTWxrdlpUWmtSSGxRQ21FeEwwUjBXaXQ0VFROd00xa3hkbTFDVW5KcU1GRmxMMGhsWmtJd2NtOW1NbUpGZW1aNU5IaFhiME5DT0hOa1ZqUkNlRE5FT0ZWamJWRm9UalpFTDFrS2NqTmliVGxGVDI1Qk1HWmlhRkpVVTNVemExbElXRVl2WW0weWVtUkhLM0UyZDA5TVVHczJjRkZVYWxadFoxQTNibEY2WW05c1duZENaRGxMYjFKeWNRbzJXRUZyTldaQlVsVmhRVzFSYVVvMVkwdFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxka3hIVkVOck5YQmpSRkpIVjFBNFFVSktRVUVyZVVaSk1XRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNURlUzTVROdGVuUXdTM0kwU1hWaVUxcDFObTlJWmtaV1FrTnRUR2R6YUVSVVdWRnNSa2Q0U2tob2RVd3JSa2hQZGdwUU5UQjFPR2xWWWxkT2JqRk9jVlIxTDFGbmVHeGFkMjVMTmpCeVozTXlVR2RQUlhVMFQybFRNbVJzWWxKNVpVZEtNVzgwYTFaWFdGcG5iSG8yY2t4aENtRjBaU3REWnpCMlUwbFVhVTlGTlVaU1ZqZFBkbkpCWmsxc2NXbDNSbTlCYWtRMWEyaHBOSFZ4YVZGeWJXdEJSMDFHV0dGa1dtOU1PV2RqTkU5QmJYTUtZbnA0TlZScllYWXdUemRNZUN0NGQwUnZZMXB4TW1OaldXOXVSMWhyTmxjdk1VOURjSE5wVFhCV01YTkpXSGd2T0VWTFVHNUpZakJMUmsxak1VUlViQXBaVkhoRFlrZFNia3hPWkN0MVkxUjRRMFIwZDIxVVNXZE5kVWw2V20xdlZ6QkpiamRzVVZoSmJYZEZVMHhNZW1SVmIycGpRVkptU214d2IwbG5MMFpJQ2prMk1WQmhORFptTjFSTGJ5dGlibmxrZUVKTllXUjVRMWh4TVVOcFRYTmhiRGRWUXdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzE3RjIxNEQ3QTY2ODQyMzg3QjFDMDg3MDU0NTNEN0Muc2sxLmV1LW5vcnRoLTEuZWtzLmFtYXpvbmF3cy5jb20nICAtLWt1YmVsZXQtZXh0cmEtYXJncyAiIiAnYW5kcmVpLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> null
-       vpc_classic_link_security_groups = [] -> null

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           encrypted             = false -> null
-           iops                  = 0 -> null
-           throughput            = 0 -> null
-           volume_size           = 100 -> null
-           volume_type           = "gp2" -> null
        }
    }

  # module.eks.aws_launch_configuration.workers[1] will be destroyed
-   resource "aws_launch_configuration" "workers" {
-       arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:a878ac94-96b5-4975-81e1-347aed002a32:launchConfigurationName/andrei-eks-worker-group-220220318131138816800000014" -> null
-       associate_public_ip_address      = false -> null
-       ebs_optimized                    = false -> null
-       enable_monitoring                = true -> null
-       iam_instance_profile             = "andrei-eks20220318131138608100000010" -> null
-       id                               = "andrei-eks-worker-group-220220318131138816800000014" -> null
-       image_id                         = "ami-0e7747683c4988ae6" -> null
-       instance_type                    = "t2.small" -> null
-       name                             = "andrei-eks-worker-group-220220318131138816800000014" -> null
-       name_prefix                      = "andrei-eks-worker-group-2" -> null
-       security_groups                  = [
-           "sg-0640ab11386009488",
-           "sg-0d54464eea313cb61",
        ] -> null
-       user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplVTFFVFhoUFJFVjZUVVJuTUU1R2IxaEVWRTE1VFVSTmVFNVVSWHBOUkdjd1RrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGxoSENtbzNNMjVtVkVaSFdVWmtaMWg1U21NM2EwSjNUVGhFTkZSR1lWY3dhWEYwWVc1Rk1XZFZNa05hVVZOd05EbExZalZXVWpCNFdVZHZSVTgxVDBWYVRtVUtSV0o0VTNoT01EUnhaWEl5VEhCeFUycDZTMWhMYm1OMFoyRnZOQzlxTmxVclUybE9ObFJXU25aVWNXZDNjR3MwUmxkRFZscFFhbEpRVnpKVmNXSTRhZ3BpZUhOTk5ESllNRkkzWlU5d0wxUmpTbTVPWWtWbmVtcEZiMkpSWXpZNU1FZ3ZOazFsWm1Vdk5FOUlNMnhyYkhOaWJtNVBiRzFoTWxrdlpUWmtSSGxRQ21FeEwwUjBXaXQ0VFROd00xa3hkbTFDVW5KcU1GRmxMMGhsWmtJd2NtOW1NbUpGZW1aNU5IaFhiME5DT0hOa1ZqUkNlRE5FT0ZWamJWRm9UalpFTDFrS2NqTmliVGxGVDI1Qk1HWmlhRkpVVTNVemExbElXRVl2WW0weWVtUkhLM0UyZDA5TVVHczJjRkZVYWxadFoxQTNibEY2WW05c1duZENaRGxMYjFKeWNRbzJXRUZyTldaQlVsVmhRVzFSYVVvMVkwdFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxka3hIVkVOck5YQmpSRkpIVjFBNFFVSktRVUVyZVVaSk1XRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNURlUzTVROdGVuUXdTM0kwU1hWaVUxcDFObTlJWmtaV1FrTnRUR2R6YUVSVVdWRnNSa2Q0U2tob2RVd3JSa2hQZGdwUU5UQjFPR2xWWWxkT2JqRk9jVlIxTDFGbmVHeGFkMjVMTmpCeVozTXlVR2RQUlhVMFQybFRNbVJzWWxKNVpVZEtNVzgwYTFaWFdGcG5iSG8yY2t4aENtRjBaU3REWnpCMlUwbFVhVTlGTlVaU1ZqZFBkbkpCWmsxc2NXbDNSbTlCYWtRMWEyaHBOSFZ4YVZGeWJXdEJSMDFHV0dGa1dtOU1PV2RqTkU5QmJYTUtZbnA0TlZScllYWXdUemRNZUN0NGQwUnZZMXB4TW1OaldXOXVSMWhyTmxjdk1VOURjSE5wVFhCV01YTkpXSGd2T0VWTFVHNUpZakJMUmsxak1VUlViQXBaVkhoRFlrZFNia3hPWkN0MVkxUjRRMFIwZDIxVVNXZE5kVWw2V20xdlZ6QkpiamRzVVZoSmJYZEZVMHhNZW1SVmIycGpRVkptU214d2IwbG5MMFpJQ2prMk1WQmhORFptTjFSTGJ5dGlibmxrZUVKTllXUjVRMWh4TVVOcFRYTmhiRGRWUXdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzE3RjIxNEQ3QTY2ODQyMzg3QjFDMDg3MDU0NTNEN0Muc2sxLmV1LW5vcnRoLTEuZWtzLmFtYXpvbmF3cy5jb20nICAtLWt1YmVsZXQtZXh0cmEtYXJncyAiIiAnYW5kcmVpLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> null
-       vpc_classic_link_security_groups = [] -> null

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           encrypted             = false -> null
-           iops                  = 0 -> null
-           throughput            = 0 -> null
-           volume_size           = 100 -> null
-           volume_type           = "gp2" -> null
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
+   resource "local_file" "kubeconfig" {
+       content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
-             cluster:
                server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_andrei-eks
            
            contexts:
-             context:
                cluster: eks_andrei-eks
                user: eks_andrei-eks
              name: eks_andrei-eks
            
            current-context: eks_andrei-eks
            
            users:
-             name: eks_andrei-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
-                     "token"
-                     "-i"
-                     "andrei-eks"
        EOT
+       directory_permission = "0755"
+       file_permission      = "0600"
+       filename             = "./kubeconfig_andrei-eks"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 10 to destroy.
```

```
module.eks.local_file.kubeconfig[0]: Creating...
module.eks.local_file.kubeconfig[0]: Creation complete after 0s [id=761770546894ce136652d2351aa4140ea750e426]
module.eks.aws_launch_configuration.workers[0]: Creating...
module.eks.aws_launch_configuration.workers[0]: Creation complete after 2s [id=andrei-eks-worker-group-120220318144827578900000001]
module.eks.aws_autoscaling_group.workers[0]: Creating...
module.eks.aws_autoscaling_group.workers[0]: Still creating... [10s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still creating... [20s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Creation complete after 29s [id=andrei-eks-worker-group-120220318144829595300000002]
module.eks.aws_autoscaling_group.workers[0] (deposed object a26b9a1e): Destroying... [id=andrei-eks-worker-group-120220318143523238000000001]
module.eks.aws_autoscaling_group.workers[0] (deposed object 8a2cb99f): Destroying... [id=andrei-eks-worker-group-120220318142201185200000002]
module.eks.aws_autoscaling_group.workers[0] (deposed object c547a308): Destroying... [id=andrei-eks-worker-group-120220318134039185000000001]
module.eks.aws_autoscaling_group.workers[0] (deposed object 4c4bbcea): Destroying... [id=andrei-eks-worker-group-120220318131150126500000016]
module.eks.aws_autoscaling_group.workers[0] (deposed object e1e73a85): Destroying... [id=andrei-eks-worker-group-120220318135647832900000002]
module.eks.aws_autoscaling_group.workers[0]: Destruction complete after 5s
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318143523238000000001, 10s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318134039185000000001, 10s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318142201185200000002, 10s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318131150126500000016, 10s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318143523238000000001, 20s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318134039185000000001, 20s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318131150126500000016, 20s elapsed]
module.eks.aws_autoscaling_group.workers[0]: Still destroying... [id=andrei-eks-worker-group-120220318142201185200000002, 20s elapsed]
module.eks.aws_launch_configuration.workers[0] (deposed object 5d15ca78): Destroying... [id=andrei-eks-worker-group-120220318131138820500000015]
module.eks.aws_launch_configuration.workers[0] (deposed object 17aaad54): Destroying... [id=andrei-eks-worker-group-120220318142159836100000001]
module.eks.aws_launch_configuration.workers[1]: Destroying... [id=andrei-eks-worker-group-220220318131138816800000014]
module.eks.aws_launch_configuration.workers[0] (deposed object 23339bec): Destroying... [id=andrei-eks-worker-group-120220318135645896200000001]
module.eks.aws_launch_configuration.workers[0]: Destruction complete after 0s
module.eks.aws_launch_configuration.workers[1]: Destruction complete after 0s
module.eks.aws_iam_instance_profile.workers[1]: Destroying... [id=andrei-eks20220318131138608100000010]
module.eks.aws_iam_instance_profile.workers[1]: Destruction complete after 0s

Apply complete! Resources: 3 added, 0 changed, 4 destroyed.

Outputs:

cluster_endpoint = "https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com"
cluster_id = "andrei-eks"
cluster_name = "andrei-eks"
cluster_security_group_id = "sg-0924af1a13f38c82c"
config_map_aws_auth = [
  {
    "binary_data" = tomap({})
    "data" = tomap({
      "mapAccounts" = <<-EOT
      []
      
      EOT
      "mapRoles" = <<-EOT
      - "groups":
        - "system:bootstrappers"
        - "system:nodes"
        "rolearn": "arn:aws:iam::994647055425:role/andrei-eks2022031813113780340000000e"
        "username": "system:node:{{EC2PrivateDNSName}}"
      
      EOT
      "mapUsers" = <<-EOT
      []
      
      EOT
    })
    "id" = "kube-system/aws-auth"
    "metadata" = tolist([
      {
        "annotations" = tomap({})
        "generate_name" = ""
        "generation" = 0
        "labels" = tomap({
          "app.kubernetes.io/managed-by" = "Terraform"
          "terraform.io/module" = "terraform-aws-modules.eks.aws"
        })
        "name" = "aws-auth"
        "namespace" = "kube-system"
        "resource_version" = "613"
        "uid" = "033ab8ab-c296-4cde-9d85-05011b8ae91b"
      },
    ])
  },
]
kubectl_config = <<EOT
apiVersion: v1
preferences: {}
kind: Config

clusters:
- cluster:
    server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
  name: eks_andrei-eks

contexts:
- context:
    cluster: eks_andrei-eks
    user: eks_andrei-eks
  name: eks_andrei-eks

current-context: eks_andrei-eks

users:
- name: eks_andrei-eks
  user:
    exec:
      apiVersion: client.authentication.k8s.io/v1alpha1
      command: aws-iam-authenticator
      args:
        - "token"
        - "-i"
        - "andrei-eks"

EOT

```